x = 10

def change():
    x = 5
    return x

def read():
    return x

print(change())
print(x)
print(read())
# еще не запускал, но думаю: после 1 принта будет 5, затем будет 5 и снова 5
# я не угадал, так как не учел, что x = 10 это обычная переменная, а не глобальная, поэтому с функцией change она не взаимодействует

counter = 0

def increment():
    x = 5
    return x


num = increment()
print(num)

# вообщем ничего я не понял, ты мне даже не объяснил как пользоваться глобально переменной, поэтому не сделал это задание




























# Затем напиши программу со счётчиком на global (функция increment() увеличивает глобальный counter). Перепиши её без global:
#     функция принимает число и возвращает новое.